// Import styles
import {
  Text,
  List,
  Section,
  BoldText,
  SubHeader,
  TextHeader,
  ListElement,
} from "../styles";

// Export cookie policy
function CookiePolicy({ cookieRef }) {
  return (
    <Section ref={cookieRef} id="cookiePolicy">
      <SubHeader>Cookie პოლიტიკა</SubHeader>
      <Text>
        ეს cookie პოლიტიკა განმარტავს, თუ როგორ ვიყენებთ ქუქი-ფაილებს და
        თვალთვალის მსგავს ტექნოლოგიებს ჩვენს ვებსაიტზე. ჩვენი ვებგვერდის
        გამოყენებით და ამ პოლიტიკის დათანხმებით, თქვენ ეთანხმებით ჩვენს მიერ
        cookies გამოყენებას ამ პოლიტიკის პირობების შესაბამისად.
      </Text>

      <TextHeader>1. რა არის Cookie?</TextHeader>
      <Text>
        ქუქი-ფაილები არის მცირე ზომის ტექსტური ფაილები, რომლებიც განთავსებულია
        თქვენს მოწყობილობაზე, როდესაც სტუმრობთ ჩვენს ვებსაიტს. ისინი ფართოდ
        გამოიყენება იმისათვის, რომ ვებსაიტებმა უფრო ეფექტურად იმუშაონ და
        უზრუნველყონ მომხმარებლის გაუმჯობესებული გამოცდილება. Cookie საშუალებას
        აძლევს ვებსაიტს ამოიცნოს თქვენი მოწყობილობა და შეინახოს ინფორმაცია
        თქვენი პრეფერენციების ან წარსული ქმედებების შესახებ.
      </Text>

      <List>
        <TextHeader>2. Cookie ტიპები რომლებსაც ჩვენ ვიყენებთ</TextHeader>

        <ListElement>
          <BoldText>ავტორიზაციის სესიის ქუქი-ფაილები:</BoldText> ეს ქუქი-ფაილები
          აუცილებელია ჩვენი ვებსაიტის ავტორიზაციისა და ავტორიზაციის პროცესების
          სათანადო ფუნქციონირებისთვის. ისინი საშუალებას გაძლევთ უსაფრთხო
          ნავიგაციის ვებსაიტზე. ქუქი-ფაილების გარეშე, ზოგიერთმა ფუნქციამ
          შეიძლება არ იმუშაოს გამართულად.
        </ListElement>

        <ListElement>
          <BoldText>Cookie policy დასტურის ქუქი-ფაილები</BoldText> ეს ქუქი
          გამოიყენება დასამახსოვრებლად, მიიღეთ თუ არა ჩვენი cookie პოლიტიკა და
          ამომხტარი შეტყობინება. ის გვეხმარება თავიდან ავიცილოთ cookie პოლიტიკის
          შესახებ შეტყობინების ჩვენება ყოველ ჯერზე, როცა ჩვენს ვებსაიტს ეწვევით.
        </ListElement>
      </List>

      <List>
        <TextHeader>3. როგორ ვიყენებთ ქუქი-ფაილებს</TextHeader>
        <Text>ჩვენ ვიყენებთ ქუქი-ფაილებს შემდეგი მიზნებისთვის:</Text>

        <ListElement>
          <BoldText>ავთენტიფიკაცია და უსაფრთხოება:</BoldText> ავტორიზაციის
          სესიის ქუქი-ფაილები დაგეხმარებათ უზრუნველყოთ თქვენი წვდომა ჩვენი
          ვებსაიტის დაცულ ზონებში.
        </ListElement>

        <ListElement>
          <BoldText>ფუნქციონალობა:</BoldText> ავტორიზაციის სესიის ქუქი-ფაილები
          ასევე იძლევა ვებსაიტის გარკვეული ფუნქციებისა და ფუნქციების გამართულად
          მუშაობის საშუალებას.
        </ListElement>

        <ListElement>
          <BoldText> ანალიტიკა და პერფომანსი:</BoldText> ჩვენ შეიძლება
          გამოვიყენოთ ქუქი-ფაილები, რათა შევაგროვოთ ინფორმაცია იმის შესახებ, თუ
          როგორ იყენებთ ჩვენს ვებსაიტს, მაგალითად, რომელ გვერდებს სტუმრობთ
          ყველაზე ხშირად. ეს გვეხმარება გავაუმჯობესოთ ვებსაიტის პერფორმანსუ და
          მომხმარებლის გამოცდილება.
        </ListElement>
      </List>

      <TextHeader>4. ქუქი-ფაილების მართვა</TextHeader>
      <Text>
        თქვენ შეგიძლიათ აკონტროლოთ და მართოთ ქუქი-ფაილები თქვენი ბრაუზერის
        პარამეტრების მეშვეობით. თქვენ შეგიძლიათ დაეთანხმოტ ქუქი-ფაილების მიღებას
        და ასევე შეგიძლიათ წაშალოთ არსებული ქუქი-ფაილები თქვენი მოწყობილობიდან.
        გთხოვთ გაითვალისწინოთ, რომ გარკვეული ქუქი-ფაილების გამორთვამ შეიძლება
        გავლენა მოახდინოს ჩვენი ვებსაიტის ფუნქციონირებაზე.
      </Text>

      <TextHeader>5. მესამე მხარის ქუქი-ფაილები</TextHeader>
      <Text>
        ჩვენ ასევე შეიძლება გამოვიყენოთ მესამე მხარის სერვისები, რომლებიც
        აყენებენ ქუქი-ფაილებს ჩვენს ვებსაიტზე. მესამე მხარის ქუქი-ფაილები
        რეგულირდება მესამე მხარის კონფიდენციალურობის შესაბამისი პოლიტიკით.
      </Text>

      <TextHeader>6. ცვლილებები cookie პოლიტიკაში</TextHeader>
      <Text>
        ჩვენ შეიძლება დროდადრო განვაახლოთ ქუქი-ფაილების პოლიტიკა, რათა აისახოს
        ცვლილებები ტექნოლოგიაში, იურიდიულ მოთხოვნებში ან ჩვენს პრაქტიკაში.
        გთხოვთ, პერიოდულად გადახედოთ ამ პოლიტიკას.
      </Text>
    </Section>
  );
}

export default CookiePolicy;
